In [1]:
import pandas as pd
import numpy as np

In [2]:
dict={
    "name":['anshu','napsnu','safal'],
    "place":['bhkt','us','kalaiya'],
    "age":[19,20,21]
}

In [3]:
df=pd.DataFrame(dict)
df

     name    place  age
0   anshu     bhkt   19
1  napsnu       us   20
2   safal  kalaiya   21

In [4]:
df.to_csv('info.csv')

In [5]:
df.to_csv('info_index.csv',index=False)

In [6]:
df.head(2)

     name place  age
0   anshu  bhkt   19
1  napsnu    us   20

In [7]:
df.tail(2)

     name    place  age
1  napsnu       us   20
2   safal  kalaiya   21

In [8]:
df.describe()

        age
count   3.0
mean   20.0
std     1.0
min    19.0
25%    19.5
50%    20.0
75%    20.5
max    21.0

In [9]:
change=pd.read_csv('info_index.csv')

In [10]:
change

     name    place  age
0   anshu     bhkt   19
1  napsnu       us   20
2   safal  kalaiya   21

In [11]:
change['name'][0]='Anshu'
change['age'][0]=25
change['place'][0]='bhkt'

C:\Users\anshu\AppData\Local\Temp\ipykernel_672\2129661535.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  change['name'][0]='Anshu'
C:\Users\anshu\AppData\Local\Temp\ipykernel_672\2129661535.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  change['age'][0]=25
C:\Users\anshu\AppData\Local\Temp\ipykernel_672\2129661535.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  change['place'][0]='bhkt'

In [12]:
change

     name    place  age
0   Anshu     bhkt   25
1  napsnu       us   20
2   safal  kalaiya   21

In [13]:
change.index=[1,2,3]

In [14]:
change

     name    place  age
1   Anshu     bhkt   25
2  napsnu       us   20
3   safal  kalaiya   21

In [15]:
change.index=['First','second','third']

In [16]:
change

          name    place  age
First    Anshu     bhkt   25
second  napsnu       us   20
third    safal  kalaiya   21

In [17]:
new=pd.DataFrame(np.random.rand(20,5),index=np.arange(20))
new.head()

          0         1         2         3         4
0  0.592699  0.339352  0.768438  0.497498  0.766505
1  0.922845  0.127437  0.349057  0.186403  0.110228
2  0.139186  0.003725  0.393830  0.107616  0.068500
3  0.309555  0.680218  0.291108  0.508225  0.712324
4  0.035171  0.414496  0.871266  0.803358  0.014892

In [18]:
new.describe()

               0          1          2          3          4
count  20.000000  20.000000  20.000000  20.000000  20.000000
mean    0.414517   0.508078   0.540050   0.571605   0.514607
std     0.287531   0.331968   0.302196   0.296061   0.309355
min     0.035171   0.003725   0.109987   0.020802   0.014892
25%     0.194215   0.221971   0.297709   0.372156   0.160005
50%     0.380269   0.553896   0.488222   0.550637   0.626390
75%     0.565955   0.752537   0.813092   0.806911   0.750282
max     0.937638   0.953945   0.968539   0.984968   0.992970

In [19]:
type(new)

pandas.core.frame.DataFrame

In [20]:
new.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
#series

In [24]:
dict={"x":12,"y":20,"z":29}
dict1=pd.Series(dict)
print(dict1)

x    12
y    20
z    29
dtype: int64

In [27]:
dic=[1,3,4]
dic1=pd.Series(dic)
print(dic1)

0    1
1    3
2    4
dtype: int64

In [28]:
dic=[1,3,4]
dic1=pd.Series(dic,index=['x','y','z'])
print(dic1)

x    1
y    3
z    4
dtype: int64

In [ ]:
#DataFrame

In [33]:
a={
    "game":['football','tabletennis','hockey'],
    "income":[120000,12000,1200]
}
a1=pd.DataFrame(a,index=['x','y','z'])
print(a1)

          game  income
x     football  120000
y  tabletennis   12000
z       hockey    1200

In [42]:
b={
    "game":['football','tabletennis','hockey'],
    "income":[120000,12000,1200]
}
b1=pd.DataFrame(b)
print(b1.loc[[0,1]])

          game  income
0     football  120000
1  tabletennis   12000